# -*- coding: utf-8 -*-
"""Story config.
"""


################################################################
#
# Sample:
#
# 1) PERSONS
#       人物簡易設定
# 2) CHARAS <- duplicated
# 2) STAGES
#       舞台基本設定
# 3) DAYS
#       年月日設定
# 4) TIMES
#       時間帯基本設定
# 5) ITEMS
#       小道具設定
# 6) WORDS
#       辞書設定
#
################################################################


PERSONS = (
        # Tag / 氏,名 / 歳 / 性別 / 職業 / 呼称 / 紹介
        ("hero", "勇者", "勇者,太郎", 16, "male", "勇者", "me:俺"),
        ("mako", "魔子", "魔王,魔子", 15, "female", "魔王", "me:ボク"),
        ("sol", "ソル", "ライガス,ソル", 18, "male", "戦士", "me:オレ"),
        ("yula", "ユラ", "サンハイム,ユラ", 25, "female", "盗賊", "me:アタシ"),
        ("maju", "魔獣", "", 10, "male", "魔獣", "me:我"),
        )

CHARAS = (
        )

STAGES = (
        # Tag / 名前 / 紹介
        )

DAYS = (
        # Tag / 名前 / 月 / 日 / 年
        )

TIMES = (
        # Tag / 名前 / 時 / 分
        )

ITEMS = (
        # Tag / 名前 / 紹介
        ("phone", "スマフ", "色々なことができる便利な魔法具"),
        )

WORDS = (
        # Tag / 名前 / 紹介
        )

