# -*- coding: utf-8 -*-
"""Story config.
"""

################################################################
#
# Sample:
#
# 1) PERSONS
#       人物簡易設定
# 2) STAGES
#       舞台基本設定
# 3) DAYS
#       年月日設定
# 4) TIMES
#       時間帯基本設定
# 5) ITEMS
#       小道具設定
# 6) WORDS
#       辞書設定
# 7) RUBIS
#       ルビ設定
# 8) LAYERS
#       レイヤ設定
#
################################################################


PERSONS = (
        # Tag / 名前 / 氏,名 / 歳 / 誕生日 / 性別 / 職業 / 呼称 / 紹介
        ("hero", "タロウ", "勇者,タロウ", 16, (1,1), "male", "勇者", "me:俺:Y:勇者:k_mam:母さん:k_dad:父さん"),
        ("mako", "魔子", "魔王,魔子", 15, (1,1), "female", "魔王", "me:ボク:k_hero:タロウ様:k_dad:父:k_mam:母"),
        ("sol", "ソル", "ライガス,ソル", 18, (1,1), "male", "戦士", "me:オレ:k_hero:タロ吉:k_mako:お嬢"),
        ("yula", "ユラ", "サンハイム,ユラ", 25, (1,1),"female", "盗賊", "me:アタシ"),
        ("blacat", "クロ", "", 99,(1,1), "female", "猫"),
        ## 町の人々
        ("clerc", "クレルク", "", 45,(1,1), "male", "神官", "me:私"),
        ("dad", "マッシュ", "", 38,(1,1), "male", "英雄", "me:ワシ"),
        ("mam", "ナターシャ", "", 37,(1,1), "female", "針子", "me:私"),
        ("gando", "ガンド", "", 55,(1,1), "male", "大工", "me:儂"),
        ### Web
        ("mania", "タローマニア", "", 30,(1,1), "male", "ファン", "me:拙者"),
        ### 店
        ("aida", "アイーダ", "", 40,(1,1), "female", "酒場の店主", "me:私"),
        ("gans", "ガンス", "", 42,(1,1), "male", "アイーダの旦那", "me:俺"),
        ("candy", "キャンディ", "", 15,(1,1), "female", "薬草屋の娘", "me:わたし"),
        ("doyle", "ドイル", "", 45,(1,1), "male", "薬草屋店主", "me:わし"),
        ### ギルド
        ("rucca", "ルッカ", "", 20,(1,1), "female", "ギルド受付", "me:わたし"),
        ("mashu", "マーシュ", "", 50,(1,1), "male", "職安受付", "me:私"),
        ### 放送局
        ("kiyoe", "キヨエ", "", 28,(1,1), "female", "放送スタッフ", "me:わたし"),
        ("yui", "ユイ", "ハツミ,ユイ", 17,(1,1), "female", "アイドル", "me:ユイ:my:あたし"),
        ("hikakin", "ニカキン", "", 35,(1,1), "male", "実況者", "me:おれ"),
        ## 城
        ("king", "王", "", 55,(1,1), "male", "王", "me:ワシ"),
        ("lina", "リーナ", "", 18,(1,1), "female", "姫", "me:わたし"),
        ("minister", "バンデラス", "", 40,(1,1), "male", "首相", "me:私:my:俺"),
        ("soldier", "兵士", "", 28,(1,1), "male", "兵士", "me:私"),
        ("arnold", "アーノルド", "", 30,(1,1), "male", "首相秘書官", "me:私"),
        ## その他
        ("geruon", "ゲルオン", "", 40,(1,1), "male", "取り立て屋", "me:俺"),
        ## 魔獣
        ("daimaou", "大魔王", "", 99,(1,1), "male", "魔王族", "me:我"),
        ("berial", "ベリアル", "", 99,(1,1), "male", "魔族", "me:オレ"),
        ("maju", "ヘイトの魔獣", "", 99, (1,1), "male", "ヘイトの魔獣", "me:我"),
        ("goblin", "ゴブリン", "", 99,(1,1), "male", "モンスター"),
        ("hobgoblin", "ホブゴブリン", "", 99,(1,1), "male", "モンスター"),
        ("slime", "スライム", "", 99,(1,1), "male", "モンスター"),
        ("bigcrow", "お化けカラス", "", 99,(1,1), "male", "モンスター"),
        ("skelton", "骸骨兵", "", 99,(1,1), "male", "モンスター"),
        ("ork", "オーク", "", 99,(1,1), "male", "モンスター"),
        ("orga", "オーガ", "", 99,(1,1), "male", "モンスター"),
        )

AREAS = (
        # Tag / 名前 / x,y / 備考
        ("Nethgard", "ネスガルド", 1000,1000),
        ("AlJihan", "アル・ジハーン", 1500,1500),
        ("Romia", "ローミア", 500,500),
        )

STAGES = (
        # Tag / 名前 / Area / 紹介
        ## Al-jihan
        ("castletown1", "ジハーン城下町", "AlJihan"),
        ("townbar1", "アイーダの酒場", "AlJihan"),
        ## Romia
        ("zaban", "ザバン", "Romia"), # ソルの故郷の山村
        ## Common
        ("city", "都市"),
        ("town", "町"),
        ("vila", "村"),
        )

DAYS = (
        # Tag / 名前 / 月 / 日 / 年
        ("current", "current", 1,1,2020),
        )

TIMES = (
        # Tag / 名前 / 時 / 分
        )

ITEMS = (
        # Tag / 名前 / 紹介
        ("smaph", "スマフ", "携帯電話に似た魔法具"),
        ("camera", "キャラメ", "撮影機材。カメラのこと"),
        ("rebuildbox", "リセットの壺", "世界を再生させることのできる壺。しかしそのエネエルギィ源は命である"),
        ## item
        ("herb", "薬草"),
        ## weapon
        ("blade", "大剣"),
        ("shortsword", "ショートソード"),
        ("leatherguard", "レザーガード"),
        ## food
        ("bottlejuice", "ぶどうジュース"),
        ("hotdog", "ホットダック"),
        ("milk", "ミルク"),
        )

WORDS = (
        # Tag / 名前 / 紹介
        ("G", "ゴル", "お金の単位"),
        ("power", "魔素", "あらゆるもののエネルギィ源"),
        ("paypay", "ポイポイ", "魔素キャッシュ"),
        ("magicitem", "魔道具"),
        ("game", "ゲェム"),
        ("gacha", "ガシャ"),
        ("sagawa", "ヤマカワ"),
        ("amazon", "ママゾン"),
        ("web", "ウェーイ部"),
        ("tweet", "トゥイート"),
        ("msg", "メッセ"),
        ("quest", "クエスト"),
        ("channel", "チャンネル"),
        ("gazou", "ガゾー"),
        ("douga", "ドーガ"),
        ("wiki", "イキペディア"),
        ("denpa", "デンパ"),
        ("icon", "アイコーン"),
        ("apli", "アプリ"),
        ("maju", "魔獣"),
        ("Y", "勇者"),
        )

RUBIS = (
        # Base / Rubi / Exclusion / Type
        )

LAYERS = (
        # Key / Title / Words
        )

