# -*- coding: utf-8 -*-
"""Story config.
"""

################################################################
#
# Sample:
#
# 1) PERSONS
#       人物簡易設定
# 2) STAGES
#       舞台基本設定
# 3) DAYS
#       年月日設定
# 4) TIMES
#       時間帯基本設定
# 5) ITEMS
#       小道具設定
# 6) WORDS
#       辞書設定
# 7) RUBIS
#       ルビ設定
# 8) LAYERS
#       レイヤ設定
#
################################################################


PERSONS = (
        # Tag / 名前 / 氏,名 / 歳 / 誕生日 / 性別 / 職業 / 呼称 / 紹介
        ("hero", "タロウ", "勇者,タロウ", 16, (1,1), "male", "勇者", "me:俺:Y:勇者:k_mam:母さん:k_dad:父さん"),
        ("mako", "魔子", "魔王,魔子", 15, (1,1), "female", "魔王", "me:ボク:k_hero:タロウ様:k_dad:父:k_mam:母"),
        ("sol", "ソル", "ライガス,ソル", 18, (1,1), "male", "戦士", "me:オレ:k_hero:タロ吉:k_mako:お嬢"),
        ("yula", "ユラ", "サンハイム,ユラ", 25, (1,1),"female", "盗賊", "me:アタシ"),
        ("blacat", "クロ", "", 99,(1,1), "female", "猫"),
        ("haru", "ハル", "ミゾラ,ハル", 16,(1,1), "female", "お手伝い", "me:わたし:k_hero:タロウさま"),
        ## 町の人々
        ("clerc", "クレルク", "", 45,(1,1), "male", "神官", "me:私"),
        ("dad", "マッシュ", "", 38,(1,1), "male", "英雄", "me:ワシ"),
        ("mam", "ナターシャ", "", 37,(1,1), "female", "針子", "me:私:k_hero:タロちゃん:k_mako:マコちゃん"),
        ("gando", "ガンド", "", 55,(1,1), "male", "大工", "me:儂"),
        ("malta", "マルタ", "", 80,(1,1), "female", "機織り", "me:わたしゃ"),
        ("cedoros", "セドロス", "", 50,(1,1), "male", "現場監督", "me:オレ"),
        ### Web
        ("mania", "タローマニア", "", 30,(1,1), "male", "ファン", "me:拙者"),
        ### 店
        ("aida", "アイーダ", "", 40,(1,1), "female", "酒場の店主", "me:私"),
        ("gans", "ガンス", "", 42,(1,1), "male", "アイーダの旦那", "me:俺"),
        ("candy", "キャンディ", "", 15,(1,1), "female", "薬草屋の娘", "me:わたし"),
        ("doyle", "ドイル", "", 45,(1,1), "male", "薬草屋店主", "me:わし"),
        ### ギルド
        ("rucca", "ルッカ", "", 20,(1,1), "female", "ギルド受付", "me:わたし"),
        ("mashu", "マーシュ", "", 50,(1,1), "male", "職安受付", "me:私"),
        ### 放送局
        ("kiyoe", "キヨエ", "", 28,(1,1), "female", "放送スタッフ", "me:わたし"),
        ("yui", "ユイ", "ハツミ,ユイ", 17,(1,1), "female", "アイドル", "me:ユイ:my:あたし"),
        ("hikakin", "ニカキン", "", 35,(1,1), "male", "実況者", "me:おれ"),
        ## 城
        ("king", "王", "", 55,(1,1), "male", "王", "me:ワシ"),
        ("lina", "リーナ", "", 18,(1,1), "female", "姫", "me:わたし"),
        ("minister", "バンデラス", "", 40,(1,1), "male", "首相", "me:私:my:俺"),
        ("soldier", "兵士", "", 28,(1,1), "male", "兵士", "me:私"),
        ("arnold", "アーノルド", "", 30,(1,1), "male", "首相秘書官", "me:私"),
        ## その他
        ("geruon", "ゲルオン", "", 40,(1,1), "male", "取り立て屋", "me:俺"),
        ## 魔獣
        ("daimaou", "大魔王", "", 99,(1,1), "male", "魔王族", "me:我"),
        ("berial", "ベリアル", "", 99,(1,1), "male", "魔族", "me:オレ"),
        ("maju", "ヘイトの魔獣", "", 99, (1,1), "male", "ヘイトの魔獣", "me:我"),
        ("goblin", "ゴブリン", "", 99,(1,1), "male", "モンスター"),
        ("hobgoblin", "ホブゴブリン", "", 99,(1,1), "male", "モンスター"),
        ("slime", "スライム", "", 99,(1,1), "male", "モンスター"),
        ("bigcrow", "お化けカラス", "", 99,(1,1), "male", "モンスター"),
        ("skelton", "骸骨兵", "", 99,(1,1), "male", "モンスター"),
        ("ork", "オーク", "", 99,(1,1), "male", "モンスター"),
        ("orga", "オーガ", "", 99,(1,1), "male", "モンスター"),
        )

AREAS = (
        # Tag / 名前 / x,y / 備考
        ("Nethgard", "ネスガルド", 1000,1000),
        ("AlJihan", "アル・ジハーン", 1500,1500),
        ("AJEast", "ジハーン東部", 2000,1800),
        ("AJWest", "ジハーン西部", 1600,1800),
        ("AJNorth", "ジハーン北部", 1800,1900),
        ("AJSouth", "ジハーン南部", 1800,2200),
        ("InAJCastle", "アル・ジハーン城（城内）", 1800,1800),
        ("Romia", "ローミア", 500,500),
        )

STAGES = (
        # Tag / 名前 / Area / 紹介
        ## Common
        ("city", "都市"),
        ("town", "町"),
        ("vila", "村"),
        ## Al-jihan
        ("mtjihan", "ジハーン山脈", "AlJihan"),
        ("neighbor1", "ジハーン近郊", "AlJihan"),
        ("jihancliff", "ジハーン近郊の崖", "AlJihan"),
        ("jihanpath", "ジハーン街道", "AlJihan"),
        ("jihanforest", "ジハーンの森", "AJNorth"),
        ("goblinnest", "ゴブリンの巣", "AJNorth"),
        ("gobruins", "ゴブリン遺跡", "AJNorth"),
        ("nestroom1", "ゴブリンの巣の一室", "AJNorth"),
        ("nestpath", "ゴブリンの巣の通路", "AJNorth"),
        ("nesthall", "ゴブリンの巣メインホール", "AJNorth"),
        ("yulahideout", "ユラの隠れ家", "AJWest"),
        ### 城下町
        ("castletown1", "ジハーン城下町", "AlJihan"),
        ("centralsquare", "中央広場", "AlJihan"),
        ("townbar1", "アイーダの酒場", "AJWest"),
        ("church1", "ジハーン教会", "AJEast"),
        ("herbshop1", "薬草屋", "AJEast"),
        ("solroom", "ソルの部屋（薬草屋屋根裏）", "AJEast"),
        ("weaponshop1", "武器屋", "AJEast"),
        ("herohome", "タロウの家", "AJWest"),
        ("heroroom", "タロウの部屋", "AJWest"),
        ("heromansion", "タロウの豪邸", "AJSouth"),
        ("herobedroom", "タロウの寝室", "AJSouth"),
        ("herooffice", "タロウの執務室", "AJSouth"),
        ("guildhead", "ギルド本部", "AlJihan"),
        ("brostation", "放送局", "AJEast"),
        ("constfield", "工事現場", "AJWest"),# 砦
        ("farm1", "農場", "AJSouth"),
        ### 城内
        ("audienceroom", "謁見の間", "InAJCastle"),
        ("hall1", "城の大ホール", "InAJCastle"),
        ("hall2", "鳳凰の間", "InAJCastle"),
        ("gate1", "城の大門", "InAJCastle"),
        ("castleprison", "城の地下牢", "InAJCastle"),
        ## Romia
        ("zaban", "ザバン", "Romia"), # ソルの故郷の山村
        )

DAYS = (
        # Tag / 名前 / 月 / 日 / 年
        ("current", "current", 1,1,2020),
        ## R1
        ("invite1", "城に呼び出された日", 4,10, 1098),
        ## R2
        ("reset1", "死に戻り１回目", 4,10, 1098),
        ("shopping1", "買い物デイ", 4,11, 1098),
        ## R3
        ("reset2", "死に戻り２回目", 4,10, 1098),
        ("daimaou", "大魔王出現日", 4,11, 1098),
        ## R4
        ("reset3", "死に戻り３回目", 4,10, 1098),
        ("working1", "働こう１日目", 4,11, 1098),
        ("working2", "働こう２日目", 4,12, 1098),
        ("working3", "働こう３日目", 4,13, 1098),
        ("working4", "働こう４日目（配信後１日）", 4,14, 1098),
        ## R5
        ("reset4", "死に戻り４回目", 4,10, 1098),
        ("quest1", "クエスト１日目", 4,11, 1098),
        ("quest2", "クエスト２日目", 4,12, 1098),
        ("quest3", "クエスト３日目", 4,15, 1098),
        ("quest4", "クエスト４日目", 4,16, 1098),
        ## R6
        ("reset5", "死に戻り５回目", 4,16, 1098),# ゴブリンクエ前に教会
        ("questRe1", "再クエスト１日目", 4,17, 1098),
        ("nextgob", "ゴブリン退治翌日", 4,18, 1098),
        ("nextslime", "スライム退治翌日", 4,19, 1098),
        ("request1", "インタビュー依頼日", 4,24, 1098),
        ("interview1", "インタビュー日１", 4,25, 1098),
        ("afterbroadcast", "放送後１日目", 4,26, 1098),
        ("request2", "城から使いが来た日", 4,30, 1098),
        ("danceball", "舞踏会", 5,3, 1098),
        ("richman", "金持ちになった", 5,15, 1098),
        ("richdays", "金持ちの日々１", 6,10, 1098),
        ("burnout", "炎上日", 6,13, 1098),
        ("demodays", "デモの日々", 6,15, 1098),
        ("prison1", "牢獄１日目", 6,15, 1098),
        ("outprison", "脱獄１日目", 6,16, 1098),
        ## R7
        ("reset6", "死に戻り６回目", 6,16, 1098),
        ("birthmaju", "魔獣誕生日", 6,18, 1098),
        )

TIMES = (
        # Tag / 名前 / 時 / 分
        )

ITEMS = (
        # Tag / 名前 / 紹介
        ("smaph", "スマフ", "携帯電話に似た魔法具"),
        ("tablet", "タブレ", "スマフの大きな板"),
        ("camera", "キャラメ", "撮影機材。カメラのこと"),
        ("rebuildbox", "リセットの壺", "世界を再生させることのできる壺。しかしそのエネエルギィ源は命である"),
        ("umark", "勇者のしるし"),
        ## item
        ("herb", "薬草"),
        ## weapon
        ("blade", "大剣"),
        ("shortsword", "ショートソード"),
        ("leatherguard", "レザーガード"),
        ## food
        ("hotdog", "ホットダック"),
        ("macaron", "マッカロン", "甘いお菓子"),
        ## drink
        ("bottlejuice", "ぶどうジュース"),
        ("milk", "ミルク"),
        )

WORDS = (
        # Tag / 名前 / 紹介
        ("god", "女神ウィリス"),
        ("kG", "ゴル", "お金の単位、読み方で"),
        ("G", "Ｇ", "単位そのまま"),
        ("power", "魔素", "あらゆるもののエネルギィ源"),
        ("paypay", "ポイポイ", "魔素キャッシュ"),
        ("magicitem", "魔道具"),
        ("game", "ゲェム"),
        ("gacha", "ガシャ"),
        ("sagawa", "ヤマカワ"),
        ("amazon", "ママゾン"),
        ("web", "ウェーイ部"),
        ("wiki", "イキペディア"),
        ("tweet", "ツイット"),
        ("RT", "リツイット"),
        ("msg", "メッセ"),
        ("quest", "クエスト"),
        ("channel", "チャンネル"),
        ("manual", "トリセツ"),
        ("gazou", "ガゾー"),
        ("douga", "ドーガ"),
        ("wiki", "イキペディア"),
        ("denpa", "デンパ"),
        ("icon", "アイコーン"),
        ("apli", "アプリ"),
        ("maju", "魔獣"),
        ("Y", "勇者"),
        )

RUBIS = (
        # Base / Rubi / Exclusion / Type
        )

LAYERS = (
        # Key / Title / Words
        )

